EventSamples/ALERT.MLSensor.MailNew/mailman-events-00001.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soap:Header>Header</soap:Header>
  <soap:Body>
    <wsnt:Notify>
      <wsnt:NotificationMessage>
        <wsnt:Topic>ALERT.MLSensor.MailNew</wsnt:Topic>
        <wsnt:ProducerReference>
          <wsa:Address>http://www.alert-project.eu/MLSensor</wsa:Address>
        </wsnt:ProducerReference>
        <wsnt:Message>
          <ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:sc="http://www.alert-project.eu/socrates" xmlns:p="http://www.alert-project.eu/panteon" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd"  >
            <ns1:head>
              <ns1:sender>MLSensor</ns1:sender>
              <ns1:timestamp>1348472809606</ns1:timestamp>
              <ns1:sequencenumber>0</ns1:sequencenumber>
            </ns1:head>
            <ns1:payload>
              <ns1:meta>
                <ns1:startTime>1348472809606</ns1:startTime>
                <ns1:endTime>1348472809621</ns1:endTime>
                <ns1:eventName>ALERT.MLSensor.MailNew</ns1:eventName>
                <ns1:eventId>0</ns1:eventId>
                <ns1:eventType>Request</ns1:eventType>
              </ns1:meta>
              <ns1:eventData>
                <r1:message>
                  <r1:from><![CDATA[michael.larouche at kdemail.net (=?iso-8859-1?q?Micha=EBl_Larouche?=)]]></r1:from>
                  <r1:date>Wed, 04 Jan 2006 19:29:31 +0200</r1:date>
                  <r1:subject><![CDATA[[Kde-hardware-devel] Offerring my help.]]></r1:subject>
                  <r1:content><![CDATA[Like I said on #solid. I offer my help of the Solid project. 

Note that I don't know anything yet about low-level system programming but 
I'll learn with the time.

My area of interests are the hardware and network integration. Also maybe work 
in collaboration with Plasma team.

-- 
Micha?l Larouche (Shock The Dark Mage)
KDE developer working on Kopete, Kamefu...on dial-up :P
--------------------------------------
Blog: http://mlarouche.blogspot.com/
MSN/Email: michael.larouche at kdemail.net
IRC: irc.freenode.org/DarkShock on #kopete, #kde-devel, #kde4-devel, #plasma, 
#kamefu
Jabber: darkshock at myjabber.net, darkshock at linux-quebec.org, 
darkshock at gmail.com
AIM: darkshock19
Gadu-Gadu: 1172438
ICQ: 29644783
Yahoo: darkshock_TT
]]></r1:content>
                </r1:message>
              </ns1:eventData>
            </ns1:payload>
          </ns1:event>
        </wsnt:Message>
      </wsnt:NotificationMessage>
    </wsnt:Notify>
  </soap:Body>
</soap:Envelope>